modm-ext/data.modm.io/docs/svd/header_stm32h5e4xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C3</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x44002800</baseAddress>
      <interrupt>
        <name>I2C3_EV</name>
        <description>I2C3 event interrupt</description>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>I2C3_ER</name>
        <description>I2C3 error interrupt</description>
        <value>81</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C4</name>
      <description>Inter-integrated Circuit Interface</description>
      <baseAddress>0x44002c00</baseAddress>
      <interrupt>
        <name>I2C4_EV</name>
        <description>I2C4 event interrupt</description>
        <value>125</value>
      </interrupt>
      <interrupt>
        <name>I2C4_ER</name>
        <description>I2C4 error interrupt</description>
        <value>126</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="I3C1">
      <name>I3C2</name>
      <description>Improved Inter-integrated Circuit Interface</description>
      <baseAddress>0x44003000</baseAddress>
      <interrupt>
        <name>I3C2_EV</name>
        <description>I3C2 Event interrupt</description>
        <value>131</value>
      </interrupt>
      <interrupt>
        <name>I3C2_ER</name>
        <description>I3C2 Error interrupt</description>
        <value>132</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM1</name>
      <description>LPTIMER</description>
      <baseAddress>0x44004400</baseAddress>
      <interrupt>
        <name>LPTIM1</name>
        <description>LPTIM1 global interrupt</description>
        <value>64</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM3</name>
      <description>LPTIMER</description>
      <baseAddress>0x44004800</baseAddress>
      <interrupt>
        <name>LPTIM3</name>
        <description>LPTIM3 global interrupt</description>
        <value>127</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM4</name>
      <description>LPTIMER</description>
      <baseAddress>0x44004c00</baseAddress>
      <interrupt>
        <name>LPTIM4</name>
        <description>LPTIM4 global interrupt</description>
        <value>128</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM5</name>
      <description>LPTIMER</description>
      <baseAddress>0x44005000</baseAddress>
      <interrupt>
        <name>LPTIM5</name>
        <description>LPTIM5 global interrupt</description>
        <value>129</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM6</name>
      <description>LPTIMER</description>
      <baseAddress>0x44005400</baseAddress>
      <interrupt>
        <name>LPTIM6</name>
        <description>LPTIM6 global interrupt</description>
        <value>130</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <description>VREFBUF</description>
      <baseAddress>0x44007400</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>VREFBUF control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENVR</name>
              <description>Voltage reference buffer enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HIZ</name>
              <description>High impedance mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRR</name>
              <description>Voltage reference buffer ready</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>VRS</name>
              <description>Voltage reference scale</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SCALE0</name>
                  <description>Voltage reference scale 0 (VREF_OUT1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE1</name>
                  <description>Voltage reference scale 1 (VREF_OUT2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE2</name>
                  <description>Voltage reference scale 2 (VREF_OUT3)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCALE3</name>
                  <description>Voltage reference scale 3 (VREF_OUT4)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>VREFBUF calibration and control register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIM</name>
              <description>TRIM[5:0] bits (Trimming code)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>Real-Time Clock</description>
      <baseAddress>0x44007800</baseAddress>
      <interrupt>
        <name>RTC</name>
        <description>RTC non-secure interrupt</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>TR</name>
          <description>RTC time register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SU</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ST</name>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>MNU</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MNT</name>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HU</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HT</name>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PM</name>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AM_OR_24</name>
                  <description>AM or 24-hour format</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PM</name>
                  <description>PM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>RTC date register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>DU</name>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DT</name>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MU</name>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>MT</name>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDU</name>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>YU</name>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>YT</name>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSR</name>
          <description>RTC sub second register</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SS</name>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <description>RTC initialization control and status register</description>
          <addressOffset>0xc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALRAWF</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALRBWF</name>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WUTWF</name>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SHPF</name>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INITS</name>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSF</name>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INITF</name>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INIT</name>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BIN</name>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Free running BCD calendar mode (Binary mode disabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONLY</name>
                  <description>Free running Binary mode (BCD mode disabled)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIX</name>
                  <description>Free running BCD calendar and Binary mode enable</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCDU</name>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BCDU_0</name>
                  <description>1s calendar increment is generated each time SS[7:0] = 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_1</name>
                  <description>1s calendar increment is generated each time SS[8:0] = 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_2</name>
                  <description>1s calendar increment is generated each time SS[9:0] = 0</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_3</name>
                  <description>1s calendar increment is generated each time SS[10:0] = 0</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_4</name>
                  <description>1s calendar increment is generated each time SS[11:0] = 0</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_5</name>
                  <description>1s calendar increment is generated each time SS[12:0] = 0</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_6</name>
                  <description>1s calendar increment is generated each time SS[13:0] = 0</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BCDU_7</name>
                  <description>1s calendar increment is generated each time SS[14:0] = 0</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RECALPF</name>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PRER</name>
          <description>RTC prescaler register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>PREDIV_S</name>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
            </field>
            <field>
              <name>PREDIV_A</name>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WUTR</name>
          <description>RTC wakeup timer register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>WUT</name>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
            <field>
              <name>WUTOCLR</name>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
