modm-ext/data.modm.io/docs/svd/header_stm32h5e4xx.svd
        <register>
          <name>LE3CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE4CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE5CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE6CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE7CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE8CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE9CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE10CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE11CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE12CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE13CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE14CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LE15CFG2</name>
          <description>PLAY Logic Element Configuration Registers 2</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>IN0_SEL</name>
              <description>Logic Element Input 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN1_SEL</name>
              <description>Logic Element Input 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN2_SEL</name>
              <description>Logic Element Input 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>IN3_SEL</name>
              <description>Logic Element Input 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CK_SEL</name>
              <description>Clock Enable Selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT0CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT1CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT2CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT3CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x10c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT4CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT5CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT6CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT7CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT8CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x120</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT9CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x124</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT10CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x128</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT11CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x12c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OUT12CFG</name>
          <description>PLAY Output Configuration Registers</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SEL</name>
              <description>Output source Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
