modm-ext/data.modm.io/docs/svd/header_stm32h5e4xx.svd
        <register>
          <name>FLIER</name>
          <description>PLAY Flag Interrupt Enable Register</description>
          <addressOffset>0x22c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLAGD_IEN0</name>
              <description>Flag Interrupt Output Direct0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN1</name>
              <description>Flag Interrupt Output Direct1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN2</name>
              <description>Flag Interrupt Output Direct2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN3</name>
              <description>Flag Interrupt Output Direct3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN4</name>
              <description>Flag Interrupt Output Direct4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN5</name>
              <description>Flag Interrupt Output Direct5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN6</name>
              <description>Flag Interrupt Output Direct6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN7</name>
              <description>Flag Interrupt Output Direct7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN8</name>
              <description>Flag Interrupt Output Direct8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN9</name>
              <description>Flag Interrupt Output Direct9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN10</name>
              <description>Flag Interrupt Output Direct10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN11</name>
              <description>Flag Interrupt Output Direct11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN12</name>
              <description>Flag Interrupt Output Direct12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN13</name>
              <description>Flag Interrupt Output Direct13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN14</name>
              <description>Flag Interrupt Output Direct14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_IEN15</name>
              <description>Flag Interrupt Output Direct15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN0</name>
              <description>Flag Interrupt Output Register 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN1</name>
              <description>Flag Interrupt Output Register 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN2</name>
              <description>Flag Interrupt Output Register 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN3</name>
              <description>Flag Interrupt Output Register 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN4</name>
              <description>Flag Interrupt Output Register 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN5</name>
              <description>Flag Interrupt Output Register 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN6</name>
              <description>Flag Interrupt Output Register 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN7</name>
              <description>Flag Interrupt Output Register 7</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN8</name>
              <description>Flag Interrupt Output Register 8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN9</name>
              <description>Flag Interrupt Output Register 9</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN10</name>
              <description>Flag Interrupt Output Register 10</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN11</name>
              <description>Flag Interrupt Output Register 11</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN12</name>
              <description>Flag Interrupt Output Register 12</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN13</name>
              <description>Flag Interrupt Output Register 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN14</name>
              <description>Flag Interrupt Output Register 14</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_IEN15</name>
              <description>Flag Interrupt Output Register 15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FLCTL</name>
          <description>PLAY Flag Control Register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLAGD_EDGE0</name>
              <description>Edge Direction for Output Direct0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE1</name>
              <description>Edge Direction for Output Direct1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE2</name>
              <description>Edge Direction for Output Direct2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE3</name>
              <description>Edge Direction for Output Direct3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE4</name>
              <description>Edge Direction for Output Direct4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE5</name>
              <description>Edge Direction for Output Direct5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE6</name>
              <description>Edge Direction for Output Direct6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE7</name>
              <description>Edge Direction for Output Direct7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE8</name>
              <description>Edge Direction for Output Direct8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE9</name>
              <description>Edge Direction for Output Direct9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE10</name>
              <description>Edge Direction for Output Direct10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE11</name>
              <description>Edge Direction for Output Direct11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE12</name>
              <description>Edge Direction for Output Direct12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE13</name>
              <description>Edge Direction for Output Direct13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE14</name>
              <description>Edge Direction for Output Direct14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGD_EDGE15</name>
              <description>Edge Direction for Output Direct15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE0</name>
              <description>Edge Direction for Output Register 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE1</name>
              <description>Edge Direction for Output Register 1</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE2</name>
              <description>Edge Direction for Output Register 2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE3</name>
              <description>Edge Direction for Output Register 3</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE4</name>
              <description>Edge Direction for Output Register 4</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE5</name>
              <description>Edge Direction for Output Register 5</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE6</name>
              <description>Edge Direction for Output Register 6</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE7</name>
              <description>Edge Direction for Output Register 7</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE8</name>
              <description>Edge Direction for Output Register 8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE9</name>
              <description>Edge Direction for Output Register 9</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE10</name>
              <description>Edge Direction for Output Register 10</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE11</name>
              <description>Edge Direction for Output Register 11</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE12</name>
              <description>Edge Direction for Output Register 12</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE13</name>
              <description>Edge Direction for Output Register 13</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE14</name>
              <description>Edge Direction for Output Register 14</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGR_EDGE15</name>
              <description>Edge Direction for Output Register 15</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>PLAY Miscellaneous Status Register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWINWBFS</name>
              <description>SWIN Register Write Busy Flag Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLCTLWBFS</name>
              <description>FLCTL Register Write Busy Flag Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>PLAY Interrupt Status Register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWINWC</name>
              <description>SWIN Register Write Complete Interrupt Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLCTLWC</name>
              <description>FLCTL Register Write Complete Interrupt Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLAGS</name>
              <description>Flags Interrupt Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>PLAY Interrupt Clear Register</description>
          <addressOffset>0x23c</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWINWC_CLR</name>
              <description>SWIN Register Write Complete Clear Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLCTLWC_CLR</name>
              <description>FLCTL Register Write Complete Clear Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>PLAY Interrupt Enable Register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <fields>
            <field>
              <name>SWINWC_IEN</name>
              <description>SWIN Register Write Complete Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLCTLWC_IEN</name>
              <description>FLCTL Register Write Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
